MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL03Z8VFK4/mcu.h
#define MODECTRL                      0x7FFFFFFF80000000      // MODECTRL


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_TAGSET register.
//
//*****************************************************************************

#define TAGSET                        0x7FFFFFFF80000000      // TAGSET


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_TAGCLEAR register.
//
//*****************************************************************************

#define TAGCLEAR                      0x7FFFFFFF80000000      // TAGCLEAR


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_LOCKACCESS register.
//
//*****************************************************************************

#define LOCKACCESS                    0x7FFFFFFF80000000      // LOCKACCESS


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_LOCKSTAT register.
//
//*****************************************************************************

#define LOCKSTAT                      0x7FFFFFFF80000000      // LOCKSTAT


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_AUTHSTAT register.
//
//*****************************************************************************

#define BIT3-BIT2                     0x00000018      // BIT3-BIT2


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICEARCH register.
//
//*****************************************************************************

#define DEVICEARCH                    0x7FFFFFFF80000000      // DEVICEARCH


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICECFG register.
//
//*****************************************************************************

#define DEVICECFG                     0x7FFFFFFF80000000      // DEVICECFG


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICETYPID register.
//
//*****************************************************************************

#define DEVICETYPID                   0x7FFFFFFF80000000      // DEVICETYPID


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // Peripheral ID


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_CTRL register.
//
//*****************************************************************************

#define NUMCMP                        0x780000000      // Number of comparators
#define DWTCFGCTRL                    0x7FFFFFF8000000      // DWT configuration controls


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_COMPn register.
//
//*****************************************************************************

#define COMP                          0x7FFFFFFF80000000      // Reference value for comparison


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_MASKn register.
//
//*****************************************************************************

#define MASK                          0x000001F0      // MASK


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT0 register.
//
//*****************************************************************************

#define MATCHED                       0x01000000      // Comparator match
#define DATAVADDR0                    0x00780000      // Data Value Address 0
#define DATAVSIZE                     0x00078000      // Data Value Size
#define DATAVMATCH                    0x00000100      // Data Value Match
#define FUNCTION                      0x00000078      // Function


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT1 register.
//
//*****************************************************************************

#define MATCHED                       0x01000000      // Comparator match
#define FUNCTION                      0x00000078      // Function


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_TBCTRL register.
//
//*****************************************************************************

#define NUMCOMP                       0x780000000      // Number of Comparators
#define ACOMP1                        0x00000002      // Action based on Comparator 1 match
#define ACOMP0                        0x00000001      // Action based on Comparator 0 match


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_DEVICECFG register.
//
//*****************************************************************************

#define DEVICECFG                     0x7FFFFFFF80000000      // DEVICECFG


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_DEVICETYPID register.
//
//*****************************************************************************

